In [41]:
import pandas as pd
hiredf = pd.read_csv('hiring.csv')
print(hiredf.to_string())

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [42]:
print(hiredf.shape)

(8, 4)

In [43]:
print(hiredf.isna().sum())

experience                    2
test_score(out of 10)         1
interview_score(out of 10)    0
salary($)                     0
dtype: int64

In [44]:
#word to number package to download
hiredf['experience'] = hiredf['experience'].fillna('zero')
hiredf

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [45]:
from word2number import w2n
hiredf['experience'] = hiredf['experience'].apply(w2n.word_to_num)
hiredf

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [47]:
mean=hiredf['test_score(out of 10)'].mean()
print(mean)

7.857142857142857

In [48]:
hiredf['test_score(out of 10)']=hiredf['test_score(out of 10)'].fillna(mean)

In [49]:
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split

In [50]:
X=hiredf.drop(columns=['salary($)'])
Y=hiredf['salary($)']

In [58]:
X_train,X_test,Y_train,Y_test=train_test_split(X,Y,test_size=0.30)

In [59]:
print(X_train.shape)
print(X_test.shape)

(5, 3)
(3, 3)

In [60]:
print(Y_train.shape)
print(Y_test.shape)

(5,)
(3,)

In [61]:
model=LinearRegression()
model.fit(X_train,Y_train)
ans=model.predict(X_test)
print(ans)

[65435.72739508 50166.42603695 55294.68983237]

In [63]:
expe=int(input("Enter Experience:"))
test=int(input("Enter testscore:"))
inte=int(input("Enter score:"))
ans=model.predict([[expe,test,inte]])
ans

Enter Experience:1
Enter testscore:2
Enter score:3

array([36328.59415147])

In [67]:
n=int(input("Enter n: "))
hiring_details =[]
for i in range(1):
    for j in range(n):
        print("Enter Experience,testscore,score:")
        details=list(map(int,input().split(',')))
        hiring_details.append(details)
    
    ans=model.predict([[expe,test,inte]])
    print(ans)

Enter n: 2
Enter Experience,testscore,score:
2,7,9
Enter Experience,testscore,score:
5,9,8
[71627.41955218]